Revit 2024 API
MetalPerforationsType Enumeration
 The enumerated type representing the permitted values for the asset property "MetalPerforations" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum MetalPerforationsType
Visual Basic
Public Enumeration MetalPerforationsType
Visual C++
public enum class MetalPerforationsType
Members
Member name | Description
None
CirclesStaggered
CirclesStraight
Squares
Grecian
Cloverleaf
Hexagon
Custom
See Also
Autodesk.Revit.DB.Visual Namespace